#+title:      A Klasse 2024-28
#+date:       [2024-09-08 So 21:40]
#+filetags:   :1a:
#+identifier: 20240908T214000
#+LANGUAGE: de
#+BIBLIOGRAPHY: ~/RoamNotes/references/Literatur.bib
#+SETUPFILE: ~/RoamNotes/config/latex_setup.org
#+ATTR_LATEX: :environment tabularx :placement [h] :center t :width linewidth
#+OPTIONS: num:nil toc:nil
#+STARTUP: fnadjust
#+STARTUP: showall
#+export_file_name: ~/RoamNotes/exports/1a.html

* Jahresplanung
[[denote:20240719T125948][Jahresplanung 01]]

http://www.veritas.at/code (rfu300)

* Notizen, Tasks, Termine
Lesen in der 2. Stunde.

<2025-06-02 Mo> - <2025-06-04 Mi>
Erste Klassen Schwimmtage ab der dritten Stunde

Ich schreibe hier einen Text hinein.

Ich schreibe hier weiter.

* Lernschiene
[[file:~/OneDrive/Dokumente/Religion_Lernschiene/]]

** Alle Themen (Überblick) [9/10]
- [X] Der Sturm auf dem See
- [X] Heilige
- [X] Heilige Orte
- [X] Die Adventzeit
- [X] Beten
- [X] Bibelquiz
- [X] Die Heilige Schrift
- [X] Menschen zur Zeit Jesu
- [X] Hl. Blasius / Hl. Rupert
- [ ] König David



* Stundenplanung

** Einführung / Ziele
Persönliche Vorstellung; Bücher austeilen!

Gemeinsames Lied.

** Wiederholung
Wie war RU?

** Lernschiene
- Heilige (Diözesanpatrone)
- Advent

AB etc kopieren (ohne Tablet arbeiten)

** Themen
Schulgottesdienst proben!

** Hefteintrag
Arbeitsweg



* Schülerliste
#+Name: 2021-students
|----------+--------------+---------------------+------+-----------+------+-----|
| First    | Last         | Name                | Note | Mitarbeit | Heft | LZK |
|----------+--------------+---------------------+------+-----------+------+-----|
| Sophie   | Auer         | [[Sophie Auer][Sophie Auer]]         |    0 |           |      |     |
| Matthias | Buchegger    | [[Matthias Buchegger][Matthias Buchegger]]  |    0 |           |      |     |
| Felix    | Eder         | [[Felix Eder][Felix Eder]]          |    0 |           |      |     |
| Samuel   | Hirscher     | [[Samuel Hirscher][Samuel Hirscher]]     |    0 |           |      |     |
| Anna     | Kainhofer    | [[Anna Kainhofer][Anna Kainhofer]]      |    0 |           |      |     |
| Ilvy     | Ramsauer     | [[Ilvy Ramsauer][Ilvy Ramsauer]]       |    0 |           |      |     |
| Nadine   | Ramsauer     | [[Nadine Ramsauer][Nadine Ramsauer]]     |    0 |           |      |     |
| Leonie   | Reschreiter  | [[Leonie Reschreiter][Leonie Reschreiter]]  |    0 |           |      |     |
| Tobias   | Rettenbacher | [[Tobias Rettenbacher][Tobias Rettenbacher]] |    0 |           |      |     |
| Jakob    | Rettenegger  | [[Jakob Rettenegger][Jakob Rettenegger]]   |    0 |           |      |     |
| Eva      | Schlager     | [[Eva Schlager][Eva Schlager]]        |    0 |           |      |     |
| Tim      | Schledt      | [[Tim Schledt][Tim Schledt]]         |    0 |           |      |     |
| Ella     | Sunkler      | [[Ella Sunkler][Ella Sunkler]]        |    0 |           |      |     |
| Finja    | Thomüller    | [[Finja Thomüller][Finja Thomüller]]     |    0 |           |      |     |
| Julia    | Windhofer    | [[Julia Windhofer][Julia Windhofer]]     |    0 |           |      |     |
|----------+--------------+---------------------+------+-----------+------+-----|
#+TBLFM: $4=vmean($5..$7);%.0f
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(Mitarbeit,@@#$2))

#+BIND: org-export-filter-timestamp-functions (tmp-f-timestamp)
#+BIND: org-export-filter-strike-through-functions (tmp-f-strike-through)
#+BEGIN_SRC emacs-lisp :exports results :results none
  (defun tmp-f-timestamp (s backend info)
    (replace-regexp-in-string "&[lg]t;\\|[][]" "" s))
  (defun tmp-f-strike-through (s backend info) "")
#+END_SRC


#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = last + '.' + first + '@abtenau.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + last + ' ' + first + ' <' + email + '>]]')
      print(':EXPORT_FILE_NAME: ' '~/RoamNotes/exports/'  + first +  '_'  + last +  '.html')
      print(':ID: ' + first + '' + last + '')
      print(':END: ')
      print('#+Name: Note_' + first + '' + last + '')
      print('|-------+-------------+-------+---------+-----------+------------|')
      print('| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |')
      print('|-------+-------------+-------+---------+-----------+------------|')
      print('|       |             |       |         |           |            |')
      print('#+tblfm: $2=@#-1')
      print('#+TBLFM: $6=vmean($4..$5);%.0f')
      print('\n')
#+END_SRC

#+RESULTS:
* Mitarbeit

** Sophie Auer
:PROPERTIES:
:EMAIL: [[mailto: Auer Sophie <Auer.Sophie@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Sophie_Auer.html
:ID: SophieAuer
:END: 
#+Name: Note_SophieAuer
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Matthias Buchegger
:PROPERTIES:
:EMAIL: [[mailto: Buchegger Matthias <Buchegger.Matthias@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Matthias_Buchegger.html
:ID: MatthiasBuchegger
:END: 
#+Name: Note_MatthiasBuchegger
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Felix Eder
:PROPERTIES:
:EMAIL: [[mailto: Eder Felix <Eder.Felix@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Felix_Eder.html
:ID: FelixEder
:END: 
#+Name: Note_FelixEder
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Samuel Hirscher
:PROPERTIES:
:EMAIL: [[mailto: Hirscher Samuel <Hirscher.Samuel@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Samuel_Hirscher.html
:ID: SamuelHirscher
:END: 
#+Name: Note_SamuelHirscher
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Anna Kainhofer
:PROPERTIES:
:EMAIL: [[mailto: Kainhofer Anna <Kainhofer.Anna@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Anna_Kainhofer.html
:ID: AnnaKainhofer
:END: 
#+Name: Note_AnnaKainhofer
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Ilvy Ramsauer
:PROPERTIES:
:EMAIL: [[mailto: Ramsauer Ilvy <Ramsauer.Ilvy@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Ilvy_Ramsauer.html
:ID: IlvyRamsauer
:END: 
#+Name: Note_IlvyRamsauer
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Nadine Ramsauer
:PROPERTIES:
:EMAIL: [[mailto: Ramsauer Nadine <Ramsauer.Nadine@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Nadine_Ramsauer.html
:ID: NadineRamsauer
:END: 
#+Name: Note_NadineRamsauer
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Leonie Reschreiter
:PROPERTIES:
:EMAIL: [[mailto: Reschreiter Leonie <Reschreiter.Leonie@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Leonie_Reschreiter.html
:ID: LeonieReschreiter
:END: 
#+Name: Note_LeonieReschreiter
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Tobias Rettenbacher
:PROPERTIES:
:EMAIL: [[mailto: Rettenbacher Tobias <Rettenbacher.Tobias@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Tobias_Rettenbacher.html
:ID: TobiasRettenbacher
:END: 
#+Name: Note_TobiasRettenbacher
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Jakob Rettenegger
:PROPERTIES:
:EMAIL: [[mailto: Rettenegger Jakob <Rettenegger.Jakob@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Jakob_Rettenegger.html
:ID: JakobRettenegger
:END: 
#+Name: Note_JakobRettenegger
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Eva Schlager
:PROPERTIES:
:EMAIL: [[mailto: Schlager Eva <Schlager.Eva@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Eva_Schlager.html
:ID: EvaSchlager
:END: 
#+Name: Note_EvaSchlager
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Tim Schledt
:PROPERTIES:
:EMAIL: [[mailto: Schledt Tim <Schledt.Tim@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Tim_Schledt.html
:ID: TimSchledt
:END: 
#+Name: Note_TimSchledt
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Ella Sunkler
:PROPERTIES:
:EMAIL: [[mailto: Sunkler Ella <Sunkler.Ella@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Ella_Sunkler.html
:ID: EllaSunkler
:END: 
#+Name: Note_EllaSunkler
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Finja Thomüller
:PROPERTIES:
:EMAIL: [[mailto: Thomüller Finja <Thomüller.Finja@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Finja_Thomüller.html
:ID: FinjaThomüller
:END: 
#+Name: Note_FinjaThomüller
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f


** Julia Windhofer
:PROPERTIES:
:EMAIL: [[mailto: Windhofer Julia <Windhofer.Julia@abtenau.schule>]]
:EXPORT_FILE_NAME: ~/RoamNotes/exports/Julia_Windhofer.html
:ID: JuliaWindhofer
:END: 
#+Name: Note_JuliaWindhofer
|-------+-------------+-------+---------+-----------+------------|
| Datum | Lernjob Nr. | Topic | LJ Note | Mitarbeit | Gesamtnote |
|-------+-------------+-------+---------+-----------+------------|
|       |             |       |         |           |            |
#+tblfm: $2=@#-1
#+TBLFM: $6=vmean($4..$5);%.0f



* Mitarbeittabelle
# In diese Tabelle trage ich die Mitarbeit während 10 Schulwochen ein. Danach kann ich mit der ersten Tabellenformel die aktuelle Durchschnittsnote errechnen. Diese kann ich in die obige Tabelle übernehmen. Nach 23 Wochen (dh einem Semster) müsste ich die Tabelle wieder leeren - hm, gibt es keine bessere Lösung? Eine Tabelle mit allen 43 Schulwochen wäre zu groß. Mit 'C-c TAB' kann ich einzelne Spalten ein- und ausklappen. Wie geht das mit mehreren Spalten?
#+Name: Mitarbeit
| Name                | Note | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |
|---------------------+------+---+---+---+---+---+---+---+---+---+----|
| [[Sophie Auer][Sophie Auer]]         |      |   |   |   |   |   |   |   |   |   |    |
| [[Matthias Buchegger][Matthias Buchegger]]  |      |   |   |   |   |   |   |   |   |   |    |
| [[Felix Eder][Felix Eder]]          |      |   |   |   |   |   |   |   |   |   |    |
| [[Samuel Hirscher][Samuel Hirscher]]     |      |   |   |   |   |   |   |   |   |   |    |
| [[Anna Kainhofer][Anna Kainhofer]]      |      |   |   |   |   |   |   |   |   |   |    |
| [[Ilvy Ramsauer][Ilvy Ramsauer]]       |      |   |   |   |   |   |   |   |   |   |    |
| [[Nadine Ramsauer][Nadine Ramsauer]]     |      |   |   |   |   |   |   |   |   |   |    |
| [[Leonie Reschreiter][Leonie Reschreiter]]  |      |   |   |   |   |   |   |   |   |   |    |
| [[Tobias Rettenbacher][Tobias Rettenbacher]] |      |   |   |   |   |   |   |   |   |   |    |
| [[Jakob Rettenegger][Jakob Rettenegger]]   |      |   |   |   |   |   |   |   |   |   |    |
| [[Eva Schlager][Eva Schlager]]        |      |   |   |   |   |   |   |   |   |   |    |
| [[Tim Schledt][Tim Schledt]]         |      |   |   |   |   |   |   |   |   |   |    |
| [[Ella Sunkler][Ella Sunkler]]        |      |   |   |   |   |   |   |   |   |   |    |
| [[Finja Thomüller][Finja Thomüller]]     |      |   |   |   |   |   |   |   |   |   |    |
| [[Julia Windhofer][Julia Windhofer]]     |      |   |   |   |   |   |   |   |   |   |    |
#+TBLFM: $2=vmean($3..$12)
#+TBLFM: $1='(identity remote(2021-students,@@#$3))


* Reflexionen

** Smartboard?
:PROPERTIES:
:CAPTURED: [2025-06-02 Mo 09:20]
:DESCRIPTION: [[file:~/RoamNotes/notes/20240717T163657--agenda__project.org::*1a (RLS) 08:35-09:25][1a (RLS) 08:35-09:25]]
:END:
Kann man wirklich die Empfindlichkeit so erhöhen, dass eine Fliege Apps verschieben kann?

Und natürlich ist da jede Gelegenheit willkommen, um laut zu werden; wegen jeder Kleinigkeit und jeder Aufgabe mich zu fragen; ... selber nachdenken? viel zu anstrengend, da fragen wir lieber Herrn Fuchs.


